import { sampleSize } from "lodash";

export class FoodService {
  menus = [
    "ข้าวมันไก่ทอด",
    "ข้าวมันไก่",
    "ข้าวขาหมู",
    "เย็นตาโฟ",
    "สุกี้แห้ง",
    "บะหมี่แห้ง",
    "เล็กแห้ง",
    "หมูกระเทียมไข่ดาว",
    "เสต็กเนื้อ",
    "กะเพราหมูกรอบ",
    "โจ๊ก",
    "ผัดไท",
    "ข้าวหน้าไก่",
    "ยำมาม่า",
    "กะเพราหมูกรอบ",
    "ก๋วยจั๋บญวน",
    "ข้ามหมูแดง",
    "ก๋วยจั๋ยน้ำใส",
    "ก๋วยจั๋บน้ำใส"
  ];

  randomMenu = (size = 3) => {
    return sampleSize(this.menus, size);
  };
}
